RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
/*
 * Modifications of the original file provided by Freescale are:
 *
 * Copyright (c) 2011 embedded brains GmbH.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/**************************************************************************/
/* FILE NAME: mpc5510.h                      COPYRIGHT (c) Freescale 2008 */
/* REVISION:  2.2                                  All Rights Reserved    */
/*                                                                        */
/* DESCRIPTION:                                                           */
/* This file contain all of the register and bit field definitions for    */
/* MPC5510.                                                               */
/**************************************************************************/
/*>>>>NOTE! this file is auto-generated please do not edit it!<<<<*/

/*************************************************/
/* Example register & bit field write:           */
/*                                               */
/*  <MODULE>.<REGISTER>.B.<BIT> = 1;             */
/*  <MODULE>.<REGISTER>.R       = 0x10000000;    */
/*                                               */
/*************************************************/

#ifndef _MPC5510_H_
#define _MPC5510_H_

#ifndef ASM

#include <stdint.h>

#include <mpc55xx/regs-edma.h>

#ifdef  __cplusplus
extern "C" {
#endif

#ifdef __MWERKS__
#pragma push
#pragma ANSI_strict off
#endif

/****************************************************************************/
/*                     MODULE : CRP                                         */
/****************************************************************************/
    struct CRP_tag {

        union {
            uint32_t R;
            struct {
                uint32_t:12;
                uint32_t IRC32KEN:1;
                uint32_t XOSCEN:1;
                  uint32_t:1;
                uint32_t OSC32KEN:1;
                uint32_t TRIM32IRC:8;
                uint32_t TRIMIRC:8;
            } B;
        } CLKSRC;               /* Clock Source Register */

        uint32_t crp_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t CNTEN:1;
                uint32_t RTCIE:1;
                uint32_t RTCF:1;
                uint32_t ROVRF:1;
                uint32_t RTCVAL:12;
                uint32_t APIEN:1;
                uint32_t APIIE:1;
                uint32_t APIF:1;
                uint32_t CLKSEL:2;
                uint32_t ROVREN:1;
                uint32_t APIVAL:10;
            } B;
        } RTCSC;                /* RTC Status and Control Register */

        union {
            uint32_t R;
            struct {
                uint32_t RTCCNT:32;
            } B;
        } RTCCNT;               /* RTC Counter Register */

        uint32_t crp_reserved2[10];

        union {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t WKPSEL7:3;
                  uint32_t:1;
                uint32_t WKPSEL6:3;
                  uint32_t:1;
                uint32_t WKPSEL5:3;
                  uint32_t:1;
                uint32_t WKPSEL4:3;
                  uint32_t:1;
                uint32_t WKPSEL3:3;
                  uint32_t:1;
                uint32_t WKPSEL2:3;
                  uint32_t:1;
                uint32_t WKPSEL1:3;
                  uint32_t:1;
                uint32_t WKPSEL0:3;
            } B;
        } WKPINSEL;             /* Wakeup Pin Source Select Register */

        union {
            uint32_t R;
            struct {
                uint32_t WKPDET7:2;
                uint32_t WKPDET6:2;
                uint32_t WKPDET5:2;
                uint32_t WKPDET4:2;
                uint32_t WKPDET3:2;
                uint32_t WKPDET2:2;
                uint32_t WKPDET1:2;
                uint32_t WKPDET0:2;
                  uint32_t:5;
                uint32_t RTCOVREN:1;
                uint32_t RTCWKEN:1;
                uint32_t APIWKEN:1;
                  uint32_t:7;
                uint32_t WKCLKSEL:1;
            } B;
        } WKSE;                 /* Wakeup Source Enable Register */

        uint32_t crp_reserved3[2];

        union {
            uint32_t R;
            struct {
                uint32_t Z1VEC:30;
                uint32_t Z1RST:1;
                uint32_t VLE:1;
            } B;
        } Z1VEC;                /* Z1 Reset Vector Register */

        union {
            uint32_t R;
            struct {
                uint32_t Z0VEC:30;
                uint32_t Z0RST:1;
                  uint32_t:1;
            } B;
        } Z0VEC;                /* Z0 Reset Vector Register */

        union {
            uint32_t R;
            struct {
                uint32_t RECPTR:30;
                uint32_t FASTREC:1;
                  uint32_t:1;
            } B;
        } RECPTR;               /* Reset Recovery Pointer Register */

