RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
        union ESCI_DR_tag {
            uint16_t R;
            struct {
                uint16_t R8:1;
                uint16_t T8:1;
                  uint16_t:6;
                uint8_t D;
            } B;
        } DR;                   /* Data Register */

        union ESCI_SR_tag {
            uint32_t R;
            struct {
                uint32_t TDRE:1;
                uint32_t TC:1;
                uint32_t RDRF:1;
                uint32_t IDLE:1;
                uint32_t OR:1;
                uint32_t NF:1;
                uint32_t FE:1;
                uint32_t PF:1;
                  uint32_t:3;
                uint32_t BERR:1;
                  uint32_t:3;
                uint32_t RAF:1;
                uint32_t RXRDY:1;
                uint32_t TXRDY:1;
                uint32_t LWAKE:1;
                uint32_t STO:1;
                uint32_t PBERR:1;
                uint32_t CERR:1;
                uint32_t CKERR:1;
                uint32_t FRC:1;
                  uint32_t:6;
                uint32_t UREQ:1;
                uint32_t OVFL:1;
            } B;
        } SR;                   /* Status Register */

        union {
            uint32_t R;
            struct {
                uint32_t LRES:1;
                uint32_t WU:1;
                uint32_t WUD0:1;
                uint32_t WUD1:1;
                uint32_t LDBG:1;
                uint32_t DSF:1;
                uint32_t PRTY:1;
                uint32_t LIN:1;
                uint32_t RXIE:1;
                uint32_t TXIE:1;
                uint32_t WUIE:1;
                uint32_t STIE:1;
                uint32_t PBIE:1;
                uint32_t CIE:1;
                uint32_t CKIE:1;
                uint32_t FCIE:1;
                  uint32_t:6;
                uint32_t UQIE:1;
                uint32_t OFIE:1;
                  uint32_t:8;
            } B;
        } LCR;                  /* LIN Control Register */

        union {
            uint32_t R;
        } LTR;                  /* LIN Transmit Register */

        union {
            uint32_t R;
        } LRR;                  /* LIN Recieve Register */

        union {
            uint32_t R;
        } LPR;                  /* LIN CRC Polynom Register  */

    };
/****************************************************************************/
/*                     MODULE : FLASH                                       */
/****************************************************************************/
    struct FLASH_tag {
        union {                 /* Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t:3;
                uint32_t SFS:1;
                uint32_t SIZE:4;
                  uint32_t:1;
                uint32_t LAS:3;
                  uint32_t:3;
                uint32_t MAS:1;
                uint32_t EER:1;
                uint32_t RWE:1;
                uint32_t BBEPE:1;
                uint32_t EPE:1;
                uint32_t PEAS:1;
                uint32_t DONE:1;
                uint32_t PEG:1;
                  uint32_t:1;
                uint32_t PRD:1;
                uint32_t STOP:1;
                  uint32_t:1;
                uint32_t PGM:1;
                uint32_t PSUS:1;
                uint32_t ERS:1;
                uint32_t ESUS:1;
                uint32_t EHV:1;
            } B;
        } MCR;

        union LMLR_tag {        /* Low/Mid Address Space Block Locking Register */
            uint32_t R;
            struct {
                uint32_t LME:1;
                  uint32_t:10;
                uint32_t SLOCK:1;
                  uint32_t:2;
                uint32_t MLOCK:2;
                  uint32_t:6;
                uint32_t LLOCK:10;
            } B;
        } LMLR; /* Legacy naming - refer to LML in Reference Manual */

        union HLR_tag {         /* High Address Space Block Locking Register */
            uint32_t R;
            struct {
                uint32_t HBE:1;
                  uint32_t:23;
                uint32_t HBLOCK:8;
            } B;
        } HLR; /* Legacy naming - refer to HBL in Reference Manual */

        union SLMLR_tag {       /* Secondary Low/Mid Block Locking Register */
            uint32_t R;
            struct {
                uint32_t SLE:1;
                  uint32_t:10;
                uint32_t SSLOCK:1;
                  uint32_t:2;
                uint32_t SMLOCK:2;
                  uint32_t:6;
                uint32_t SLLOCK:10;
            } B;
        } SLMLR; /* Legacy naming - refer to SLL in Reference Manual */

        union {                 /* Low/Mid Address Space Block Select Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MSEL:2;
                  uint32_t:6;
                uint32_t LSEL:10;
            } B;
        } LMSR; /* Legacy naming - refer to LMS in Reference Manual */

        union {                 /* High Address Space Block Select Register */
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t HBSEL:4;
            } B;
        } HSR; /* Legacy naming - refer to HBS in Reference Manual */

        union {                 /* Address Register */
            uint32_t R;
            struct {
                uint32_t:10;
                uint32_t ADDR:19;
                  uint32_t:3;
            } B;
        } AR; /* Legacy naming - refer to ADR in Reference Manual */

        union {                 /* Platform Flash Configuration Register for Port 0 */
            uint32_t R;
            struct {
                uint32_t LBCFG:4;
                uint32_t ARB:1;
                uint32_t PRI:1;
                  uint32_t:5;
                uint32_t M4PFE:1;
                uint32_t M3PFE:1;
                uint32_t M2PFE:1;
                uint32_t M1PFE:1;
                uint32_t M0PFE:1;
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;
                  uint32_t:1;
                uint32_t DPFEN:1;
                  uint32_t:1;
                uint32_t IPFEN:1;
                  uint32_t:1;
                uint32_t PFLIM:2;
                uint32_t BFEN:1;
            } B;
        } PFCRP0;

        union {                 /* Platform Flash Configuration Register for Port 1 */
            uint32_t R;
            struct {
                uint32_t LBCFG:4;
                  uint32_t:7;
                uint32_t M4PFE:1;
                uint32_t M3PFE:1;
                uint32_t M2PFE:1;
                uint32_t M1PFE:1;
                uint32_t M0PFE:1;
                uint32_t APC:3;
                uint32_t WWSC:2;
                uint32_t RWSC:3;
                  uint32_t:1;
                uint32_t DPFEN:1;
                  uint32_t:1;
                uint32_t IPFEN:1;
                  uint32_t:1;
                uint32_t PFLIM:2;
                uint32_t BFEN:1;
            } B;
        } PFCRP1;

