RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
        uint32_t FLEXCAN_reserved3[256];

        union {
            uint32_t R;
            struct {
                uint32_t MI:32;
            } B;
        } RXIMR[64];            /* RX Individual Mask Registers */

    };
/****************************************************************************/
/*                     MODULE : FMPLL                                       */
/****************************************************************************/
    struct FMPLL_tag {

        uint32_t FMPLL_reserved0;

        union FMPLL_SYNSR_tag { /* Synthesiser Status Register */
            uint32_t R;
            struct {
                uint32_t:22;
                uint32_t LOLF:1;
                uint32_t LOC:1;
                uint32_t MODE:1;
                uint32_t PLLSEL:1;
                uint32_t PLLREF:1;
                uint32_t LOCKS:1;
                uint32_t LOCK:1;
                uint32_t LOCF:1;
                uint32_t CALDONE:1;
                uint32_t CALPASS:1;
            } B;
        } SYNSR;

        union FMPLL_ESYNCR1_tag {
            uint32_t R;
            struct {
                uint32_t:1;
                uint32_t CLKCFG:3;
                  uint32_t:8;
                uint32_t EPREDIV:4;
                  uint32_t:8;
                uint32_t EMFD:8;
            } B;
        } ESYNCR1;

        union FMPLL_ESYNCR2_tag {
            uint32_t R;
            struct {
                uint32_t:8;
                uint32_t LOCEN:1;
                uint32_t LOLRE:1;
                uint32_t LOCRE:1;
                uint32_t LOLIRQ:1;
                uint32_t LOCIRQ:1;
                  uint32_t:1;
                uint32_t ERATE:2;
                  uint32_t:5;
                uint32_t EDEPTH:3;
                  uint32_t:2;
                uint32_t ERFD:6;
            } B;
        } ESYNCR2;

    };
/****************************************************************************/
/*                          MODULE : i2c                                    */
/****************************************************************************/
    struct I2C_tag {
        union {
            uint8_t R;
            struct {
                uint8_t AD:7;
                  uint8_t:1;
            } B;
        } IBAD;                 /* Module Bus Address Register */

        union {
            uint8_t R;
            struct {
                uint8_t MULT:2;
                uint8_t ICR:6;
            } B;
        } IBFD;                 /* Module Bus Frequency Register */

        union {
            uint8_t R;
            struct {
                uint8_t MDIS:1;
                uint8_t IBIE:1;
                uint8_t MS:1;
                uint8_t TX:1;
                uint8_t NOACK:1;
                uint8_t RSTA:1;
                uint8_t DMAEN:1;
                  uint8_t:1;
            } B;
        } IBCR;                 /* Module Bus Control Register */

        union {
            uint8_t R;
            struct {
                uint8_t TCF:1;
                uint8_t IAAS:1;
                uint8_t IBB:1;
                uint8_t IBAL:1;
                  uint8_t:1;
                uint8_t SRW:1;
                uint8_t IBIF:1;
                uint8_t RXAK:1;
            } B;
        } IBSR;                 /* Module Status Register */

        union {
            uint8_t R;
            struct {
                uint8_t DATA:8;
            } B;
        } IBDR;                 /* Module Data Register */

        union {
            uint8_t R;
            struct {
                uint8_t BIIE:1;
                  uint8_t:7;
            } B;
        } IBIC;                 /* Module Interrupt Configuration Register */

    };
/****************************************************************************/
/*                          MODULE : INTC                                   */
/****************************************************************************/
    struct INTC_tag {
        union {
            uint32_t R;
            struct {
                uint32_t:18;
                uint32_t VTES_PRC1:1;
                  uint32_t:4;
                uint32_t HVEN_PRC1:1;
                  uint32_t:2;
                uint32_t VTES:1;
                  uint32_t:4;
                uint32_t HVEN:1;
            } B;
        } MCR;                  /* Module Configuration Register */

        int32_t INTC_reserved1;

        union {
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t PRI:4;
            } B;
        } CPR;             /* Processor 0 Current Priority Register */

        union {
            uint32_t R;
            struct {
                uint32_t:28;
                uint32_t PRI:4;
            } B;
        } CPR_PRC1;             /* Processor 1 Current Priority Register */

        union {
            uint32_t R;
            struct {
                uint32_t VTBA:21;
                uint32_t INTVEC:9;
                  uint32_t:2;
            } B;
        } IACKR;           /* Processor 0 Interrupt Acknowledge Register */

        union {
            uint32_t R;
            struct {
                uint32_t VTBA_PRC1:21;
                uint32_t INTVEC_PRC1:9;
                  uint32_t:2;
            } B;
        } IACKR_PRC1;           /* Processor 1 Interrupt Acknowledge Register */

        union {
            uint32_t R;
            struct {
                uint32_t:32;
            } B;
        } EOIR;            /* Processor 0 End of Interrupt Register */

        union {
            uint32_t R;
            struct {
                uint32_t:32;
            } B;
        } EOIR_PRC1;            /* Processor 1 End of Interrupt Register */

        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t SET:1;
                uint8_t CLR:1;
            } B;
        } SSCIR[8];             /* Software Set/Clear Interruput Register */

        uint32_t intc_reserved2[6];

        union {
            uint8_t R;
            struct {
                uint8_t PRC_SEL:2;
                  uint8_t:2;
                uint8_t PRI:4;
            } B;
        } PSR[294];             /* Software Set/Clear Interrupt Register */

