RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
    };
/****************************************************************************/
/*                     MODULE : MCM                                         */
/****************************************************************************/
    struct MCM_tag {

        uint32_t mcm_reserved1[5];

        uint16_t mcm_reserved2;

        union {
            uint16_t R;
            struct {
                uint16_t RO:1;
                  uint16_t:6;
                uint16_t SWRWH:1;
                uint16_t SWE:1;
                uint16_t SWRI:2;
                uint16_t SWT:5;
            } B;
        } SWTCR;                /* Software Watchdog Timer Control */

        uint8_t mcm_reserved3[3];

        union {
            uint8_t R;
        } SWTSR;                /* SWT Service Register */

        uint8_t mcm_reserved4[3];

        union {
            uint8_t R;
            struct {
                uint8_t:7;
                uint8_t SWTIC:1;
            } B;
        } SWTIR;                /* SWT Interrupt Register */

        uint32_t mcm_reserved5[1];

        union {
            uint32_t R;
            struct {
                uint32_t PRI:1;
                  uint32_t:31;
            } B;
        } MUDCR;                /* Misc. User Defined Control Register */

        uint32_t mcm_reserved6[6];
        uint8_t mcm_reserved7[3];

        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t ERNCR:1;
                uint8_t EFNCR:1;
            } B;
        } ECR;                  /* ECC Configuration Register */

        uint8_t mcm_reserved8[3];

        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t RNCE:1;
                uint8_t FNCE:1;
            } B;
        } ESR;                  /* ECC Status Register */

        uint16_t mcm_reserved9;

        union {
            uint16_t R;
            struct {
                uint16_t:6;
                uint16_t FRCNCI:1;
                uint16_t FR1NCI:1;
                  uint16_t:1;
                uint16_t ERRBIT:7;
            } B;
        } EEGR;                 /* ECC Error Generation Register */

        uint32_t mcm_reserved10;

        union {
            uint32_t R;
        } FEAR;                 /* Flash ECC Address Register */

        uint16_t mcm_reserved11;

        union {
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t FEMR:4;
            } B;
        } FEMR;                 /* Flash ECC Master Register */

        union {
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROTECTION:4;
            } B;
        } FEAT;                 /* Flash ECC Attributes Register */

        union {
            uint32_t R;
        } FEDRH;                /* Flash ECC Data High Register */

        union {
            uint32_t R;
        } FEDRL;                /* Flash ECC Data Low Register */

        union {
            uint32_t R;
            struct {
                uint32_t REAR:32;
            } B;
        } REAR;                 /* RAM ECC Address */

        uint16_t mcm_reserved12;

        union {
            uint8_t R;
            struct {
                uint8_t:4;
                uint8_t REMR:4;
            } B;
        } REMR;                 /* RAM ECC Master */

        union {
            uint8_t R;
            struct {
                uint8_t WRITE:1;
                uint8_t SIZE:3;
                uint8_t PROTECTION:4;
            } B;
        } REAT;                 /*  RAM ECC Attributes Register */

        union {
            uint32_t R;
        } REDRH;                /* RAM ECC Data High Register */

        union {
            uint32_t R;
        } REDRL;                /* RAMECC Data Low Register */

    };
/****************************************************************************/
/*                          MODULE : MPU                                    */
/****************************************************************************/
    struct MPU_tag {
        union {
            uint32_t R;
            struct {
                uint32_t SPERR:8;
                  uint32_t:4;
                uint32_t HRL:4;
                uint32_t NSP:4;
                uint32_t NGRD:4;
                  uint32_t:7;
                uint32_t VLD:1;
            } B;
        } CESR;                 /* Module Control/Error Status Register */

        uint32_t mpu_reserved1[3];

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR0;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR0;

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR1;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR1;

        union {
            uint32_t R;
            struct {
                uint32_t EADDR:32;
            } B;
        } EAR2;

        union {
            uint32_t R;
            struct {
                uint32_t EACD:16;
                uint32_t EPID:8;
                uint32_t EMN:4;
                uint32_t EATTR:3;
                uint32_t ERW:1;
            } B;
        } EDR2;

        uint32_t mpu_reserved2[246];

        struct {
            union {
                uint32_t R;
                struct {
                    uint32_t SRTADDR:27;
                      uint32_t:5;
                } B;
            } WORD0;            /* Region Descriptor n Word 0 */

            union {
                uint32_t R;
                struct {
                    uint32_t ENDADDR:27;
                      uint32_t:5;
                } B;
            } WORD1;            /* Region Descriptor n Word 1 */

            union {
                uint32_t R;
                struct {
                    uint32_t:6;
                    uint32_t M4RE0:1;
                    uint32_t M4WE:1;
                    uint32_t M3PE:1;
                    uint32_t M3SM:2;
                    uint32_t M3UM:3;
                    uint32_t M2PE:1;
                    uint32_t M2SM:2;
                    uint32_t M2UM:3;
                    uint32_t M1PE:1;
                    uint32_t M1SM:2;
                    uint32_t M1UM:3;
                    uint32_t M0PE:1;
                    uint32_t M0SM:2;
                    uint32_t M0UM:3;
                } B;
            } WORD2;            /* Region Descriptor n Word 2 */

            union {
                uint32_t R;
                struct {
                    uint32_t PID:8;
                    uint32_t PIDMASK:8;
                      uint32_t:15;
                    uint32_t VLD:1;
                } B;
            } WORD3;            /* Region Descriptor n Word 3 */

        } RGD[16];

        uint32_t mpu_reserved3[192];

        union {
            uint32_t R;
            struct {
                uint32_t:6;
                uint32_t M4RE:1;
                uint32_t M4WE:1;
                uint32_t M3PE:1;
                uint32_t M3SM:2;
                uint32_t M3UM:3;
                uint32_t M2PE:1;
                uint32_t M2SM:2;
                uint32_t M2UM:3;
                uint32_t M1PE:1;
                uint32_t M1SM:2;
                uint32_t M1UM:3;
                uint32_t M0PE:1;
                uint32_t M0SM:2;
                uint32_t M0UM:3;
            } B;
        } RGDAAC[16];           /* Region Descriptor Alternate Access Control n */
    };
/****************************************************************************/
/*                          MODULE : pit                                    */
/****************************************************************************/
    struct PIT_tag {
        union {
            uint32_t R;
            struct {
                uint32_t TSV:32;
            } B;
        } TLVAL[9];

        uint32_t pit_reserved1[23];

        union {
            uint32_t R;
            struct {
                uint32_t TVL:32;
            } B;
        } TVAL[9];

