RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
        uint32_t pit_reserved2[23];

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t TIF8:1;
                uint32_t TIF7:1;
                uint32_t TIF6:1;
                uint32_t TIF5:1;
                uint32_t TIF4:1;
                uint32_t TIF3:1;
                uint32_t TIF2:1;
                uint32_t TIF1:1;
                uint32_t RTIF:1;
            } B;
        } PITFLG;

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t TIE8:1;
                uint32_t TIE7:1;
                uint32_t TIE6:1;
                uint32_t TIE5:1;
                uint32_t TIE4:1;
                uint32_t TIE3:1;
                uint32_t TIE2:1;
                uint32_t TIE1:1;
                uint32_t RTIE:1;
            } B;
        } PITINTEN;

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t ISEL8:1;
                uint32_t ISEL7:1;
                uint32_t ISEL6:1;
                uint32_t ISEL5:1;
                uint32_t ISEL4:1;
                uint32_t ISEL3:1;
                uint32_t ISEL2:1;
                uint32_t ISEL1:1;
                  uint32_t:1;
            } B;
        } PITINTSEL;

        union {
            uint32_t R;
            struct {
                uint32_t:23;
                uint32_t PEN8:1;
                uint32_t PEN7:1;
                uint32_t PEN6:1;
                uint32_t PEN5:1;
                uint32_t PEN4:1;
                uint32_t PEN3:1;
                uint32_t PEN2:1;
                uint32_t PEN1:1;
                uint32_t PEN0:1;
            } B;
        } PITEN;

        union {
            uint32_t R;
            struct {
                uint32_t:7;
                uint32_t MDIS:1;
                  uint32_t:24;
            } B;
        } PITCTRL;

    };
/****************************************************************************/
/*                          MODULE : sem4                                   */
/****************************************************************************/
    struct SEMA4_tag {
        union {
            uint8_t R;
            struct {
                uint8_t:6;
                uint8_t GTFSM:2;
            } B;
        } GATE[16];             /* Gate n Register */

        uint32_t sema4_reserved1[12];   /* {0x40-0x10}/4 = 0x0C */

        union {
            uint16_t R;
            struct {
                uint16_t INE0:1;
                uint16_t INE1:1;
                uint16_t INE2:1;
                uint16_t INE3:1;
                uint16_t INE4:1;
                uint16_t INE5:1;
                uint16_t INE6:1;
                uint16_t INE7:1;
                uint16_t INE8:1;
                uint16_t INE9:1;
                uint16_t INE10:1;
                uint16_t INE11:1;
                uint16_t INE12:1;
                uint16_t INE13:1;
                uint16_t INE14:1;
                uint16_t INE15:1;
            } B;
        } CP0INE;

        uint16_t sema4_reserved2[3];    /* {0x48-0x42}/2 = 0x03 */

        union {
            uint16_t R;
            struct {
                uint16_t INE0:1;
                uint16_t INE1:1;
                uint16_t INE2:1;
                uint16_t INE3:1;
                uint16_t INE4:1;
                uint16_t INE5:1;
                uint16_t INE6:1;
                uint16_t INE7:1;
                uint16_t INE8:1;
                uint16_t INE9:1;
                uint16_t INE10:1;
                uint16_t INE11:1;
                uint16_t INE12:1;
                uint16_t INE13:1;
                uint16_t INE14:1;
                uint16_t INE15:1;
            } B;
        } CP1INE;

        uint16_t sema4_reserved3[27];   /* {0x80-0x4A}/2 = 0x1B */

        union {
            uint16_t R;
            struct {
                uint16_t GN0:1;
                uint16_t GN1:1;
                uint16_t GN2:1;
                uint16_t GN3:1;
                uint16_t GN4:1;
                uint16_t GN5:1;
                uint16_t GN6:1;
                uint16_t GN7:1;
                uint16_t GN8:1;
                uint16_t GN9:1;
                uint16_t GN10:1;
                uint16_t GN11:1;
                uint16_t GN12:1;
                uint16_t GN13:1;
                uint16_t GN14:1;
                uint16_t GN15:1;
            } B;
        } CP0NTF;

        uint16_t sema4_reserved4[3];    /* {0x88-0x82}/2 = 0x03 */

        union {
            uint16_t R;
            struct {
                uint16_t GN0:1;
                uint16_t GN1:1;
                uint16_t GN2:1;
                uint16_t GN3:1;
                uint16_t GN4:1;
                uint16_t GN5:1;
                uint16_t GN6:1;
                uint16_t GN7:1;
                uint16_t GN8:1;
                uint16_t GN9:1;
                uint16_t GN10:1;
                uint16_t GN11:1;
                uint16_t GN12:1;
                uint16_t GN13:1;
                uint16_t GN14:1;
                uint16_t GN15:1;
            } B;
        } CP1NTF;

        uint16_t sema4_reserved5[59];   /* {0x100-0x8A}/2 = 0x3B */

        union {
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t RSTGSM:2;
                  uint16_t:1;
                uint16_t RSTGMS:3;
                uint16_t RSTGTN:8;
            } B;
        } RSTGT;

        uint16_t sema4_reserved6;

        union {
            uint16_t R;
            struct {
                uint16_t:2;
                uint16_t RSTNSM:2;
                  uint16_t:1;
                uint16_t RSTNMS:3;
                uint16_t RSTNTN:8;
            } B;
        } RSTNTF;
    };
/****************************************************************************/
/*                     MODULE : SIU                                         */
/****************************************************************************/
    struct SIU_tag {

        int32_t SIU_reserved0;

        union {                 /* MCU ID Register */
            uint32_t R;
            struct {
                uint32_t PARTNUM:16;
                uint32_t CSP:1;
                uint32_t PKG:5;
                  uint32_t:2;
                uint32_t MASKNUM_MAJOR:4;
                uint32_t MASKNUM_MINOR:4;
            } B;
        } MIDR;

        int32_t SIU_reserved1;

