RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
        int32_t SIU_reserved3[295];

        union {                 /* GPIO Pin Data Output Registers */
            uint8_t R;
            struct {
                uint8_t:7;
                uint8_t PDO:1;
            } B;
        } GPDO[146];

        int32_t SIU_reserved4[91];

        union {                 /* GPIO Pin Data Input Registers */
            uint8_t R;
            struct {
                uint8_t:7;
                uint8_t PDI:1;
            } B;
        } GPDI[146];

        int32_t SIU_reserved5[27];

        union {                 /* IMUX Register */
            uint32_t R;
            struct {
                uint32_t TSEL3:2;
                uint32_t TSEL2:2;
                uint32_t TSEL1:2;
                uint32_t TSEL0:2;
                  uint32_t:24;
            } B;
        } ISEL0;

        union {                 /* IMUX Register */
            uint32_t R;
            struct {
                uint32_t ESEL15:2;
                uint32_t ESEL14:2;
                uint32_t ESEL13:2;
                uint32_t ESEL12:2;
                uint32_t ESEL11:2;
                uint32_t ESEL10:2;
                uint32_t ESEL9:2;
                uint32_t ESEL8:2;
                uint32_t ESEL7:2;
                uint32_t ESEL6:2;
                uint32_t ESEL5:2;
                uint32_t ESEL4:2;
                uint32_t ESEL3:2;
                uint32_t ESEL2:2;
                uint32_t ESEL1:2;
                uint32_t ESEL0:2;
            } B;
        } ISEL1;

        union {                 /* IMUX Register */
            uint32_t R;
            struct {
                uint32_t SELEMIOS15:2;
                uint32_t SELEMIOS14:2;
                uint32_t SELEMIOS13:2;
                uint32_t SELEMIOS12:2;
                uint32_t SELEMIOS11:2;
                uint32_t SELEMIOS10:2;
                uint32_t SELEMIOS9:2;
                uint32_t SELEMIOS8:2;
                uint32_t SELEMIOS7:2;
                uint32_t SELEMIOS6:2;
                uint32_t SELEMIOS5:2;
                uint32_t SELEMIOS4:2;
                uint32_t SELEMIOS3:2;
                uint32_t SELEMIOS2:2;
                uint32_t SELEMIOS1:2;
                uint32_t SELEMIOS0:2;
            } B;
        } ISEL2;

        int32_t SIU_reserved6[29];

        union {                 /* Chip Configuration Register Register */
            uint32_t R;
            struct {
                uint32_t:14;
                uint32_t MATCH:1;
                uint32_t DISNEX:1;
                  uint32_t:16;
            } B;
        } CCR;

        union {                 /* External Clock Configuration Register Register */
            uint32_t R;
            struct {
                uint32_t:30;
                uint32_t EBDF:2;
            } B;
        } ECCR;

        union {                 /* Compare A High Register */
            uint32_t R;
        } CMPAH;

        union {                 /* Compare A Low Register */
            uint32_t R;
        } CMPAL;

        union {                 /* Compare B High Register */
            uint32_t R;
        } CMPBH;

        union {                 /* Compare B Low Register */
            uint32_t R;
        } CMPBL;

        int32_t SIU_reserved7[2];

        union {                 /* System CLock Register */
            uint32_t R;
            struct {
                uint32_t SYSCLKSEL:2;
                uint32_t SYSCLKDIV:2;
                uint32_t SWTCLKSEL:1;
                  uint32_t:11;
                uint32_t LPCLKDIV7:2;
                uint32_t LPCLKDIV6:2;
                uint32_t LPCLKDIV5:2;
                uint32_t LPCLKDIV4:2;
                uint32_t LPCLKDIV3:2;
                uint32_t LPCLKDIV2:2;
                uint32_t LPCLKDIV1:2;
                uint32_t LPCLKDIV0:2;
            } B;
        } SYSCLK;

        union {                 /* Halt Register */
            uint32_t R;
        } HLT;

        union {                 /* Halt Acknowledge Register */
            uint32_t R;
        } HLTACK;

        int32_t SIU_reserved8[149];

        union {                 /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t PB:16;
            } B;
        } PGPDO0;

        union {                 /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t PC:16;
                uint32_t PD:16;
            } B;
        } PGPDO1;

        union {                 /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t PE:16;
                uint32_t PF:16;
            } B;
        } PGPDO2;

        union {                 /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t PG:16;
                uint32_t PH:16;
            } B;
        } PGPDO3;

        union {                 /* Parallel GPIO Pin Data Output Register */
            uint32_t R;
            struct {
                uint32_t PJ:16;
                  uint32_t:16;
            } B;
        } PGPDO4;

        int32_t SIU_reserved9[11];

        union {                 /* Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t PA:16;
                uint32_t PB:16;
            } B;
        } PGPDI0;

        union {                 /* Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t PC:16;
                uint32_t PD:16;
            } B;
        } PGPDI1;

        union {                 /* Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t PE:16;
                uint32_t PF:16;
            } B;
        } PGPDI2;

        union {                 /* Parallel GPIO Pin Data Input Register */
            uint32_t R;
            struct {
                uint32_t PG:16;
                uint32_t PH:16;
            } B;
        } PGPDI3;

