RTEMS/rtems/bsps/powerpc/mpc55xxevb/include/mpc55xx/fsl-mpc551x.h
    typedef struct uMB_HEADER   /* message buffer header */
    {
        F_HEADER_t FRAME_HEADER;
        uint16_t DATA_OFFSET;
        S_STATUS_t SLOT_STATUS;
    } MB_HEADER_t;
/****************************************************************************/
/*                     MODULE : MLB                                         */
/****************************************************************************/
    struct MLB_tag {

        union {                 /* MLB Module Configuration Register */
            uint32_t R;
            struct {
                uint32_t MDIS:1;
                  uint32_t:15;
                uint32_t MDATOBSE:1;
                uint32_t MSIGOBS:1;
                uint32_t MSLOTE:1;
                  uint32_t:2;
                uint32_t MSVRQIE:1;
                uint32_t MDATRQE:1;
                  uint32_t:2;
                uint32_t MSVRQDL:3;
                uint32_t MSVRQCIE:1;
                uint32_t MIFSEL:1;
                uint32_t MSBFEPOL:1;
                uint32_t MDBFEPOL:1;
            } B;
        } MCR;

        union {                 /* MLB Blank Register */
            uint32_t R;
            struct {
                uint32_t:31;
                uint32_t BLANK:1;
            } B;
        } MBR;

        union {                 /* MLB Status Register */
            uint32_t R;
            struct {
                uint32_t:29;
                uint32_t MDATRQS:1;
                uint32_t MSYSS:1;
                uint32_t MSVRQS:1;
            } B;
        } MSR;

        union {                 /* RX Control Channel Address Register */
            uint32_t R;
            struct {
                uint32_t RXCCHA_ACEN:1;
                  uint32_t:25;
                uint32_t RXCCHA:5;
                  uint32_t:1;
            } B;
        } RXCCHAR;

        union {                 /* RX Async Channel Address Register */
            uint32_t R;
            struct {
                uint32_t RXACHA_ACEN:1;
                  uint32_t:25;
                uint32_t RXACHA:5;
                  uint32_t:1;
            } B;
        } RXACHAR;

        union {                 /* TX Control Channel Address Register */
            uint32_t R;
            struct {
                uint32_t TXCCHA_ACEN:1;
                  uint32_t:25;
                uint32_t TXCCHA:5;
                  uint32_t:1;
            } B;
        } TXCCHAR;

        union {                 /* TX Async Channel Address Register */
            uint32_t R;
            struct {
                uint32_t TXACHA_ACEN:1;
                  uint32_t:25;
                uint32_t TXACHA:5;
                  uint32_t:1;
            } B;
        } TXACHAR;

        union {                 /* TX Sync Channel Address Register */
            uint32_t R;
            struct {
                uint32_t TXSCHA_ACEN:1;
                  uint32_t:25;
                uint32_t TXSCHA:5;
                  uint32_t:1;
            } B;
        } TXSCHAR;

        union {                 /* TX Sync Channel Address Mask Register */
            uint32_t R;
            struct {
                uint32_t:26;
                uint32_t TXSCHAM:5;
                  uint32_t:1;
            } B;
        } TXSCHAMR;

        union {                 /* Clock Adjust Control Register */
            uint32_t R;
            struct {
                uint32_t:16;
                uint32_t PDLY:16;
            } B;
        } CLKACR;

        union {                 /* RX Isochronous Channel Address Register */
            uint32_t R;
            struct {
                uint32_t RXICHA_ACEN:1;
                  uint32_t:25;
                uint32_t RXICHA:5;
                  uint32_t:1;
            } B;
        } RXICHAR;

        union {                 /* TX Isochronous Channel Address Register */
            uint32_t R;
            struct {
                uint32_t TXICHA_ACEN:1;
                  uint32_t:25;
                uint32_t TXICHA:5;
                  uint32_t:1;
            } B;
        } TXICHAR;

    };

/* Define memories */

#define SRAM_START   0x40000000UL
#define SRAM_SIZE       0x14000UL
#define SRAM_END     0x40013FFFUL

#define FLASH_START         0x0UL
#define FLASH_SIZE     0x180000UL
#define FLASH_END      0x17FFFFUL

/* Define instances of modules */
#define SEMA4     (*(volatile struct SEMA4_tag *)     0xFFF10000UL)
#define MPU       (*(volatile struct MPU_tag *)       0xFFF14000UL)
#define MCM       (*(volatile struct MCM_tag *)       0xFFF40000UL)
#define EDMA      (*(volatile struct EDMA_tag *)      0xFFF44000UL)
#define INTC      (*(volatile struct INTC_tag *)      0xFFF48000UL)
#define EQADC     (*(volatile struct EQADC_tag *)     0xFFF80000UL)
#define MLB       (*(volatile struct MLB_tag *)       0xFFF84000UL)
#define I2C       (*(volatile struct I2C_tag *)       0xFFF88000UL)
#define DSPI_A    (*(volatile struct DSPI_tag *)      0xFFF90000UL)
#define DSPI_B    (*(volatile struct DSPI_tag *)      0xFFF94000UL)
#define DSPI_C    (*(volatile struct DSPI_tag *)      0xFFF98000UL)
#define DSPI_D    (*(volatile struct DSPI_tag *)      0xFFF9C000UL)
#define ESCI_A    (*(volatile struct ESCI_tag *)      0xFFFA0000UL)
#define ESCI_B    (*(volatile struct ESCI_tag *)      0xFFFA4000UL)
#define ESCI_C    (*(volatile struct ESCI_tag *)      0xFFFA8000UL)
#define ESCI_D    (*(volatile struct ESCI_tag *)      0xFFFAC000UL)
#define ESCI_E    (*(volatile struct ESCI_tag *)      0xFFFB0000UL)
#define ESCI_F    (*(volatile struct ESCI_tag *)      0xFFFB4000UL)
#define ESCI_G    (*(volatile struct ESCI_tag *)      0xFFFB8000UL)
#define ESCI_H    (*(volatile struct ESCI_tag *)      0xFFFBC000UL)
#define CAN_A     (*(volatile struct FLEXCAN_tag *)   0xFFFC0000UL)
#define CAN_B     (*(volatile struct FLEXCAN_tag *)   0xFFFC4000UL)
#define CAN_C     (*(volatile struct FLEXCAN_tag *)   0xFFFC8000UL)
#define CAN_D     (*(volatile struct FLEXCAN_tag *)   0xFFFCC000UL)
#define CAN_E     (*(volatile struct FLEXCAN_tag *)   0xFFFD0000UL)
#define CAN_F     (*(volatile struct FLEXCAN_tag *)   0xFFFD4000UL)
#define FR        (*(volatile struct FR_tag *)        0xFFFD8000UL)
#define DMAMUX    (*(volatile struct DMAMUX_tag *)    0xFFFDC000UL)
#define PIT       (*(volatile struct PIT_tag *)       0xFFFE0000UL)
#define EMIOS     (*(volatile struct EMIOS_tag *)     0xFFFE4000UL)
#define SIU       (*(volatile struct SIU_tag *)       0xFFFE8000UL)
#define CRP       (*(volatile struct CRP_tag *)       0xFFFEC000UL)
#define FMPLL     (*(volatile struct FMPLL_tag *)     0xFFFF0000UL)
#define EBI       (*(volatile struct EBI_tag *)       0xFFFF4000UL)
#define FLASH     (*(volatile struct FLASH_tag *)     0xFFFF8000UL)

#ifdef __MWERKS__
#pragma pop
#endif

